In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
s = pd.Series({'Ram': 12, 'Sam': 5, 'Jadu': 7, 'Madhu': 13})

In [3]:
s

Ram      12
Sam       5
Jadu      7
Madhu    13
dtype: int64

In [4]:
s.values

array([12,  5,  7, 13], dtype=int64)

In [5]:
s.index

Index(['Ram', 'Sam', 'Jadu', 'Madhu'], dtype='object')

In [6]:
type(s.values)

numpy.ndarray

In [7]:
type(s.index)

pandas.core.indexes.base.Index

In [8]:
s[1]

5

In [9]:
s['Sam']

5

In [10]:
s

Ram      12
Sam       5
Jadu      7
Madhu    13
dtype: int64

In [11]:
s[[0,1,3]]

Ram      12
Sam       5
Madhu    13
dtype: int64

In [12]:
s[['Ram', 'Sam', 'Madhu']]

Ram      12
Sam       5
Madhu    13
dtype: int64

## Slicing in Pandas

In [13]:
s[::2]

Ram     12
Jadu     7
dtype: int64

In [14]:
s[::-1]

Madhu    13
Jadu      7
Sam       5
Ram      12
dtype: int64

In [15]:
s['Ram':'Madhu']

Ram      12
Sam       5
Jadu      7
Madhu    13
dtype: int64

In [16]:
s['Hari']=6
s['sita']=9
s['gita']=15

In [17]:
s

Ram      12
Sam       5
Jadu      7
Madhu    13
Hari      6
sita      9
gita     15
dtype: int64

In [18]:
s += 10 # s= s+10

In [19]:
s

Ram      22
Sam      15
Jadu     17
Madhu    23
Hari     16
sita     19
gita     25
dtype: int64

In [20]:
np.average(s)

19.571428571428573

In [21]:
sum(s)/len(s)

19.571428571428573

In [22]:
y = 2 * s ** 2 + 3 * s + 4

In [23]:
y

Ram      1038
Sam       499
Jadu      633
Madhu    1131
Hari      564
sita      783
gita     1329
dtype: int64

In [24]:
s

Ram      22
Sam      15
Jadu     17
Madhu    23
Hari     16
sita     19
gita     25
dtype: int64

# Boolean Indexing

In [25]:
s >= 20

Ram       True
Sam      False
Jadu     False
Madhu     True
Hari     False
sita     False
gita      True
dtype: bool

In [26]:
s[[True, False, False, True, False, False, True]]

Ram      22
Madhu    23
gita     25
dtype: int64

In [27]:
s[s>=20]

Ram      22
Madhu    23
gita     25
dtype: int64

# If no index mentioned then default index assigned

In [28]:
s1 = pd.Series([12, 5, 7, 13, 6])

In [29]:
s1

0    12
1     5
2     7
3    13
4     6
dtype: int64

In [30]:
s2=pd.Series([12, 5, 7, 13, 6], index=['Ram', 'Sam', 'Jadu', 'Madhu', 'Hari'])

In [31]:
s2

Ram      12
Sam       5
Jadu      7
Madhu    13
Hari      6
dtype: int64

# Mismatch of Index and Values give error

In [32]:
s3=pd.Series([12, 5, 7 ,13, 6], index=['Ram', 'Sam', 'Jadu', 'Madhu'])

ValueError: Length of passed values is 5, index implies 4.

In [33]:
s4=pd.Series([12, 5, 7 ,13], index=['Ram', 'Sam', 'Jadu', 'Madhu', 'Hari'])

ValueError: Length of passed values is 4, index implies 5.

# DataFrame

In [34]:
d = pd.DataFrame({'phy': {'ram': 12, 'sam': 5},'chem':{'ram': 7, 'sam': 13}})

In [35]:
d

     phy  chem
ram   12     7
sam    5    13

In [36]:
# Without specifying Index will take by default index 0,1,2,3.....

In [37]:
d1= pd.DataFrame({'phy': [12,5,7,13],'chem': [6,9,5,12],'math': [1,19,13,14]})

In [38]:
d1

   phy  chem  math
0   12     6     1
1    5     9    19
2    7     5    13
3   13    12    14

In [39]:
# Index can also be specified with the above code separately

In [40]:
d1= pd.DataFrame({'phy': [12,5,7,13],'chem': [6,9,5,12],'math': [1,19,13,14]}, index=['ram','sam','jadu','madhu'])

In [41]:
d1

       phy  chem  math
ram     12     6     1
sam      5     9    19
jadu     7     5    13
madhu   13    12    14

In [42]:
d3 = pd.DataFrame(np.random.randint(0, 101, (10, 3)), index=map(lambda i: 'S' + str(i), range(10)), columns=['phy', 'chem','math'])

In [43]:
d3

    phy  chem  math
S0   20    24    49
S1   79    63    99
S2    5    33    94
S3   16    85    54
S4   97    47    83
S5   76    65    36
S6   10    94    21
S7   10     2    16
S8   94    95    48
S9   47    95     6

In [44]:
d4=d3.copy()

In [45]:
d4

    phy  chem  math
S0   20    24    49
S1   79    63    99
S2    5    33    94
S3   16    85    54
S4   97    47    83
S5   76    65    36
S6   10    94    21
S7   10     2    16
S8   94    95    48
S9   47    95     6

In [46]:
d4['Total']=d4['phy']+d4['chem']+d4['math']
d4

    phy  chem  math  Total
S0   20    24    49     93
S1   79    63    99    241
S2    5    33    94    132
S3   16    85    54    155
S4   97    47    83    227
S5   76    65    36    177
S6   10    94    21    125
S7   10     2    16     28
S8   94    95    48    237
S9   47    95     6    148

In [49]:
d3[['phy']]

    phy
S0   20
S1   79
S2    5
S3   16
S4   97
S5   76
S6   10
S7   10
S8   94
S9   47

In [48]:
d3[['phy', 'math']]

    phy  math
S0   20    49
S1   79    99
S2    5    94
S3   16    54
S4   97    83
S5   76    36
S6   10    21
S7   10    16
S8   94    48
S9   47     6

In [50]:
d3['phy':'math']

Empty DataFrame
Columns: [phy, chem, math]
Index: []

In [ ]:
# Slicing works on rows

In [51]:
d3['S0':'S5']

    phy  chem  math
S0   20    24    49
S1   79    63    99
S2    5    33    94
S3   16    85    54
S4   97    47    83
S5   76    65    36

In [52]:
d3

    phy  chem  math
S0   20    24    49
S1   79    63    99
S2    5    33    94
S3   16    85    54
S4   97    47    83
S5   76    65    36
S6   10    94    21
S7   10     2    16
S8   94    95    48
S9   47    95     6

In [53]:
d3.loc['S2':'S6',['phy','math']]

    phy  math
S2    5    94
S3   16    54
S4   97    83
S5   76    36
S6   10    21

In [54]:
d3.iloc[2:6,[0,2]]

    phy  math
S2    5    94
S3   16    54
S4   97    83
S5   76    36